size(540, 500);
background(255, 255, 255);

// クイズ ( その 1 ) 家
triangle(100, 20, 20, 80, 180, 80);
rect(40, 80, 120, 60);
rect(60, 100, 40, 20);
line(80, 100, 80, 120);
rect(120, 100, 20, 40);
ellipse(136, 120, 4, 4);

// クイズ ( その 2 ) ロゴマーク
// J リーグ
fill(33, 24, 22);
rect(270, 45, 50, 45);
rect(240, 90, 80, 10);
arc(280, 100, 80, 80, 0, PI);
noStroke();
fill(255, 255, 255);
ellipse(280, 100, 25, 25);
fill(211, 45, 38);
ellipse(298, 117, 25, 25);
// 2020東京五輪 初期のロゴ
fill(173, 143, 81);
rect(400, 20, 60, 60);
fill(179, 180, 179);
rect(460, 80, 60, 60);
fill(255, 255, 255);
ellipse(460, 80, 125, 125);
fill(54, 54, 54);
rect(440, 20, 40, 120);
fill(210, 44, 38);
ellipse(500, 40, 40, 40);
// 五輪マーク
noFill();
strokeWeight(3);
stroke(0, 0, 0);
ellipse(460, 190, 34, 34);
stroke(51, 121, 177); // 青
ellipse(420, 190, 34, 34);
stroke(215, 67, 71); // 赤
ellipse(500, 190, 34, 34);
stroke(240, 186, 67); // 黄
ellipse(440, 206, 34, 34);
stroke(70, 156, 79); // 緑
ellipse(480, 206, 34, 34);
